[
  {
    "id": "001",
    "nome": "Processador Intel Core i5-12400F",
    "categoria": "Componentes",
    "descricao": "O Intel Core i5-12400F é um processador de 12ª geração da família Alder Lake, oferecendo desempenho excepcional para quem busca um equilíbrio entre potência e custo-benefício. Com 6 núcleos de desempenho (Performance-cores) e 12 threads, ele é ideal para jogos, aplicações multitarefa e produtividade no dia a dia. Operando com frequência base de 2.5 GHz e podendo alcançar até 4.4 GHz em modo turbo, proporciona respostas rápidas e fluidez mesmo em tarefas mais exigentes. Por não possuir GPU integrada (modelo “F”), recomenda-se o uso com uma placa de vídeo dedicada. Sua compatibilidade com a plataforma LGA 1700 garante suporte às mais novas tecnologias, como DDR5 (com placas compatíveis) e PCIe 5.0, quando combinado com placas-mãe atualizadas. Uma excelente escolha para quem deseja montar um PC potente e atual sem extrapolar o orçamento.",
    "preco": 53123.99,
    "promocao": 0.98,
    "fabricante": "Intel",
    "modelo": "i5-12400F",
    "estoque": 32
  },
  {
    "id": "002",
    "nome": "Placa-mãe ASUS Prime B660M-A D4",
    "categoria": "Componentes",
    "descricao": "A ASUS Prime B660M-A D4 é uma placa-mãe no formato micro-ATX, projetada para usuários que querem aproveitar ao máximo os recursos da 12ª geração Intel, mantendo compatibilidade com memórias DDR4, mais acessíveis e amplamente disponíveis. Equipada com o chipset Intel B660, ela oferece suporte a PCIe 4.0, M.2 NVMe de alta velocidade, portas USB 3.2 Gen 1/2, além de um sistema de energia robusto com VRM de qualidade e dissipadores eficientes. Conta com diversos recursos de proteção e durabilidade da ASUS, como 5X Protection III, que assegura estabilidade e longevidade ao sistema. Com BIOS intuitiva e design elegante em preto e prata, é ideal para quem busca estabilidade, conectividade e desempenho em uma placa-mãe compacta e eficiente.",
    "preco": 3186.99,
    "promocao": 0.76,
    "fabricante": "ASUS",
    "modelo": "Prime B660M-A",
    "estoque": 20
  },
  {
    "id": "003",
    "nome": "Memória Kingston Fury Beast 16GB DDR4",
    "categoria": "Componentes",
    "descricao": "A Kingston Fury Beast 16GB DDR4 é uma das opções mais populares entre gamers e entusiastas de desempenho. Este módulo de memória conta com alta frequência e baixa latência, garantindo uma resposta ágil tanto em jogos quanto em tarefas pesadas como edição de vídeo, modelagem 3D e uso de múltiplas abas no navegador. Além disso, seu dissipador de calor com design agressivo contribui para manter a temperatura sob controle, mesmo sob uso intenso. Compatível com perfis Intel XMP, a configuração e overclocking são simples e seguras. Com 16GB em um único módulo, há a possibilidade de fácil expansão futura em sistemas com múltiplos slots. A confiabilidade da marca Kingston complementa o pacote, sendo sinônimo de qualidade e durabilidade.",
    "preco": 3373.99,
    "promocao": 0.92,
    "fabricante": "Kingston",
    "modelo": "Fury Beast",
    "estoque": 45
  },
  {
    "id": "004",
    "nome": "SSD Kingston NV2 1TB NVMe Gen4",
    "categoria": "Componentes",
    "descricao": "O Kingston NV2 1TB NVMe Gen4 é uma solução de armazenamento ultrarrápida para usuários que exigem desempenho de alto nível. Com interface PCIe Gen4 x4, oferece velocidades de leitura de até 3500MB/s e gravação de até 2100MB/s, proporcionando carregamentos quase instantâneos de sistemas operacionais, jogos e softwares pesados. Sua capacidade de 1TB é ideal para quem precisa armazenar grandes volumes de dados, como bibliotecas de jogos, projetos criativos ou backups. O formato M.2 2280 facilita a instalação em notebooks e desktops compatíveis, e seu consumo de energia eficiente contribui para um sistema mais fresco e econômico. É uma escolha certeira para quem busca agilidade, espaço e confiabilidade com a garantia da Kingston.",
    "preco": 2856.99,
    "promocao": 0.89,
    "fabricante": "Kingston",
    "modelo": "NV2 1TB",
    "estoque": 0
  },
  {
    "id": "005",
    "nome": "Mouse Gamer Logitech G502 Hero",
    "categoria": "Periféricos",
    "descricao": "O Logitech G502 Hero é um dos mouses gamers mais renomados do mercado, combinando precisão extrema, ergonomia e personalização avançada. Equipado com o sensor HERO 25K, oferece até 25.600 DPI com rastreamento 1:1 e sem aceleração, sendo ideal para jogadores competitivos que exigem o máximo em performance. Possui 11 botões programáveis, perfeitos para atalhos em jogos ou produtividade, e um sistema de pesos ajustáveis, permitindo personalizar a sensação do mouse conforme seu estilo. A construção robusta e os switches mecânicos de alta durabilidade garantem longevidade e conforto mesmo após horas de uso contínuo. Além disso, o software Logitech G HUB oferece controle total sobre configurações de DPI, iluminação RGB e comandos dos botões. Um mouse completo para quem busca o melhor em desempenho e versatilidade.",
    "preco": 1248.99,
    "promocao": 0.84,
    "fabricante": "Logitech",
    "modelo": "G502 Hero",
    "estoque": 27
  },
  {
    "id": "006",
    "nome": "Monitor LG 24” LED Full HD 75Hz",
    "categoria": "Periféricos",
    "descricao": "O Monitor LG 24” LED Full HD 75Hz é a escolha perfeita para quem busca qualidade de imagem, conforto visual e desempenho. Com uma tela de 23.8 polegadas, resolução 1920x1080 (Full HD) e taxa de atualização de 75Hz, proporciona imagens nítidas, suaves e cores vibrantes tanto para produtividade quanto para entretenimento. Seu painel LED com tecnologia Anti-Glare (antirreflexo) reduz o cansaço visual em longas sessões de uso. Conta ainda com entradas HDMI e VGA, compatibilidade com montagem VESA, filtro de luz azul e tecnologia Flicker Safe, que protege os olhos da cintilação da tela. É uma excelente opção para quem quer desempenho visual com ótimo custo-benefício.",
    "preco": 3427.99,
    "promocao": 0.79,
    "fabricante": "LG",
    "modelo": "24MK430H",
    "estoque": 15
  },
  {
    "id": "007",
    "nome": "Teclado Mecânico Redragon Kumara K552",
    "categoria": "Periféricos",
    "descricao": "O Redragon Kumara K552 é um teclado mecânico compacto, robusto e altamente responsivo, ideal para gamers e usuários exigentes. Equipado com switches Outemu Blue, oferece aquele clique tátil e audível clássico, perfeito para digitação e jogos de precisão. Seu formato tenkeyless (sem teclado numérico) economiza espaço e melhora a ergonomia para o mouse, enquanto o chassi em aço reforçado garante durabilidade superior. As teclas são retroiluminadas com LED vermelho, resistentes a desgaste e respingos d’água. É um dos modelos com melhor custo-benefício do mercado, oferecendo qualidade premium a um preço acessível.",
    "preco": 854.99,
    "promocao": 0.77,
    "fabricante": "Redragon",
    "modelo": "Kumara K552",
    "estoque": 40
  },
  {
    "id": "008",
    "nome": "Fonte Corsair CV550 550W 80 Plus Bronze",
    "categoria": "Componentes",
    "descricao": "A Corsair CV550 entrega 550W de potência real com certificação 80 Plus Bronze, garantindo eficiência energética de até 85%, menor geração de calor e economia de energia. Ideal para PCs gamers e de uso geral, ela fornece energia estável e confiável para componentes exigentes. Conta com circuito PFC ativo, ventoinha de 120mm com controle térmico, e múltiplas proteções contra sobrecarga, curto-circuito e sobretensão. Seu formato compacto facilita a instalação em diversos gabinetes, e os cabos pretos discretos ajudam na estética interna. Uma fonte confiável para manter seu sistema operando com segurança.",
    "preco": 3023.99,
    "promocao": 0.91,
    "fabricante": "Corsair",
    "modelo": "CV550",
    "estoque": 12
  },
  {
    "id": "009",
    "nome": "Gabinete Gamer Bluecase BG-024",
    "categoria": "Componentes",
    "descricao": "O Gabinete Bluecase BG-024 é uma solução acessível e estilosa para montar seu setup gamer. Com design moderno em preto fosco e painel frontal com acabamento texturizado, oferece excelente ventilação com suporte para múltiplas ventoinhas, incluindo até 3 frontais, 1 traseira e superiores. Possui janela lateral acrílica, que permite visualizar os componentes internos, e baias internas bem distribuídas, além de espaço para placas de vídeo de grande porte. Compatível com placas-mãe ATX, mATX e Mini-ITX, é uma opção equilibrada para quem busca um gabinete funcional com visual marcante.",
    "preco": 1069.99,
    "promocao": 0.82,
    "fabricante": "Bluecase",
    "modelo": "BG-024",
    "estoque": 4
  },
  {
    "id": "011",
    "nome": "Notebook Acer Aspire 5 A515-45",
    "categoria": "Computadores",
    "descricao": "O Acer Aspire 5 A515-45 é um notebook versátil e eficiente, ideal para estudos, trabalho e uso diário. Equipado com processador AMD Ryzen 5 5500U, 8GB de RAM e SSD de 256GB, oferece excelente desempenho multitarefa e inicialização rápida do sistema. Sua tela 15.6” Full HD antirreflexo proporciona ótima experiência visual para tarefas longas, enquanto o design fino e elegante o torna prático para levar a qualquer lugar. Conta ainda com teclado com layout ABNT2, portas USB-C, HDMI, Wi-Fi AC e bateria de longa duração. Uma escolha sólida para quem busca mobilidade com performance confiável.",
    "preco": 12855.99,
    "promocao": 0.79,
    "fabricante": "Acer",
    "modelo": "Aspire 5 A515-45-R760",
    "estoque": 14
  },
  {
    "id": "012",
    "nome": "Impressora HP DeskJet Ink Advantage 2774",
    "categoria": "Periféricos",
    "descricao": "A HP DeskJet Ink Advantage 2774 é uma impressora multifuncional compacta e econômica, perfeita para residências e escritórios pequenos. Com funções de impressão, cópia e digitalização, ela é fácil de configurar e usar, inclusive via Wi-Fi e aplicativo HP Smart, permitindo impressões diretamente do celular ou tablet. Suporta conexão com múltiplos dispositivos e utiliza cartuchos de tinta acessíveis com boa durabilidade. Ideal para tarefas escolares, documentos do dia a dia e digitalizações rápidas, seu design discreto se adapta bem a qualquer ambiente.",
    "preco": 2454.99,
    "promocao": 0.87,
    "fabricante": "HP",
    "modelo": "DeskJet 2774",
    "estoque": 23
  },
  {
    "id": "013",
    "nome": "Headset Gamer HyperX Cloud Stinger Core",
    "categoria": "Periféricos",
    "descricao": "O HyperX Cloud Stinger Core é um headset leve, confortável e com excelente qualidade de som, desenvolvido especialmente para gamers. Possui drivers de 40mm que entregam som estéreo imersivo, microfone com cancelamento de ruído ajustável, e controle de volume no cabo para fácil acesso. Seu arco ajustável e almofadas em espuma oferecem conforto durante longas sessões de jogo. Compatível com PC, consoles e dispositivos móveis, é a escolha perfeita para quem quer comunicação clara e imersão em jogos sem gastar muito.",
    "preco": 5309.99,
    "promocao": 0.96,
    "fabricante": "HyperX",
    "modelo": "Cloud Stinger Core",
    "estoque": 30
  },
  {
    "id": "014",
    "nome": "Webcam Logitech C920 Full HD",
    "categoria": "Periféricos",
    "descricao": "A Logitech C920 é uma webcam consagrada no mercado, ideal para videochamadas, gravações e transmissões ao vivo. Com resolução Full HD 1080p, foco automático e correção de luz automática, proporciona imagens nítidas e profissionais mesmo em ambientes com iluminação desfavorável. Conta com duplo microfone estéreo, que capta áudio com clareza e naturalidade. Compatível com Windows, macOS e Linux, é plug and play via USB e funciona perfeitamente em plataformas como Zoom, OBS, Microsoft Teams e Discord. A C920 é referência em qualidade para streamers, professores e profissionais.",
    "preco": 16836.99,
    "promocao": 0.98,
    "fabricante": "Logitech",
    "modelo": "C920",
    "estoque": 17
  },
  {
    "id": "015",
    "nome": "Pendrive Sandisk Ultra 64GB USB 3.0",
    "categoria": "Acessórios",
    "descricao": "O SanDisk Ultra 64GB USB 3.0 é um pendrive compacto, confiável e rápido, ideal para transportar arquivos com praticidade. Com tecnologia USB 3.0, oferece velocidades de leitura de até 130 MB/s, garantindo transferências muito mais rápidas do que pendrives tradicionais. Seu design retrátil protege o conector sem necessidade de tampa, tornando-o mais durável para o uso diário. Com 64GB de capacidade, é excelente para armazenar documentos, fotos, vídeos e backups. Compatível com PCs, notebooks, TVs e sistemas automotivos, é uma solução prática e portátil para o dia a dia.",
    "preco": 1795.99,
    "promocao": 0.97,
    "fabricante": "Sandisk",
    "modelo": "Ultra 64GB",
    "estoque": 120
  },
  {
    "id": "016",
    "nome": "Switch TP-Link TL-SF1008D 8 Portas",
    "categoria": "Redes",
    "descricao": "O TP-Link TL-SF1008D é um switch de rede com 8 portas Fast Ethernet (10/100Mbps), projetado para fornecer uma solução prática, silenciosa e confiável para expansão de rede em residências ou pequenos escritórios. Com instalação plug and play, não requer configuração e permite conectar rapidamente computadores, impressoras, câmeras IP e outros dispositivos. Seu design compacto e discreto economiza espaço, enquanto a tecnologia Green Ethernet reduz o consumo de energia automaticamente. A estrutura sem ventoinha garante operação totalmente silenciosa, ideal para ambientes onde o ruído deve ser mínimo. É uma solução simples e eficiente para melhorar a conectividade com excelente custo-benefício.",
    "preco": 438.99,
    "promocao": 0.8,
    "fabricante": "TP-Link",
    "modelo": "TL-SF1008D",
    "estoque": 40
  },
  {
    "id": "018",
    "nome": "Cooler para CPU Cooler Master Hyper 212",
    "categoria": "Componentes",
    "descricao": "O Cooler Master Hyper 212 é um dos coolers a ar mais renomados do mercado, oferecendo desempenho térmico eficiente aliado a um design robusto. Equipado com heatpipes em contato direto (Direct Contact Technology) e uma ventoinha PWM de 120mm, proporciona excelente dissipação de calor mesmo sob cargas intensas. Compatível com diversas plataformas Intel e AMD, é uma opção versátil tanto para upgrades quanto para montagens novas. Sua ventoinha silenciosa e eficiente pode ser substituída ou complementada por uma segunda, permitindo operação em push-pull. Ideal para overclocking moderado, ele mantém o processador operando em temperaturas seguras com baixo ruído.",
    "preco": 10617.99,
    "promocao": 0.98,
    "fabricante": "Cooler Master",
    "modelo": "Hyper 212 BE",
    "estoque": 0
  },
  {
    "id": "021",
    "nome": "Placa de Vídeo Gigabyte GeForce RTX 4060 8GB",
    "categoria": "Componentes",
    "descricao": "A Gigabyte GeForce RTX 4060 8GB traz o poder da arquitetura NVIDIA Ada Lovelace para gamers e criadores exigentes. Com 8GB de memória GDDR6, suporte a Ray Tracing, DLSS 3.0, e aceleração por IA, oferece uma experiência fluida em jogos modernos com alto nível de realismo. Esta placa é ideal para jogar em 1080p ou até 1440p, com ótimo desempenho em FPS e qualidade gráfica. O sistema de resfriamento WINDFORCE 2X da Gigabyte garante temperaturas baixas com baixo ruído, mesmo em sessões intensas. Além disso, conta com construção reforçada, backplate metálico e design compacto, tornando-a compatível com a maioria dos gabinetes. É a escolha ideal para quem busca performance de nova geração com eficiência energética.",
    "preco": 20390.99,
    "promocao": 0.9,
    "fabricante": "Gigabyte",
    "modelo": "GV-N4060WF2OC-8GD",
    "estoque": 11
  },
  {
    "id": "022",
    "nome": "HD Seagate BarraCuda 2TB 7200RPM",
    "categoria": "Componentes",
    "descricao": "O Seagate BarraCuda 2TB 7200RPM é um disco rígido confiável, com excelente capacidade para armazenamento de arquivos pesados como jogos, vídeos, fotos e backups. Com interface SATA III (6Gb/s) e velocidade de rotação de 7200 RPM, oferece bom desempenho em leitura e gravação, ideal para sistemas que precisam de grande volume de dados com acesso frequente. É perfeito para complementar um sistema com SSD, oferecendo espaço adicional a baixo custo. A linha BarraCuda é reconhecida pela durabilidade, eficiência e excelente compatibilidade com desktops, workstations e servidores domésticos.",
    "preco": 3798.99,
    "promocao": 0.92,
    "fabricante": "Seagate",
    "modelo": "ST2000DM008",
    "estoque": 38
  },
  {
    "id": "023",
    "nome": "Scanner Epson Perfection V19",
    "categoria": "Periféricos",
    "descricao": "O Epson Perfection V19 é um scanner compacto e de alta qualidade, ideal para digitalizar fotos, documentos e ilustrações com precisão. Com resolução óptica de até 4800 x 4800 dpi, garante detalhes nítidos e cores fiéis. Alimentado via cabo USB (sem necessidade de fonte externa), ele é extremamente portátil e prático. A tampa com articulação especial permite digitalizar livros e objetos mais grossos com facilidade. A interface amigável e os botões de atalho agilizam o uso no dia a dia. É uma excelente escolha para estudantes, fotógrafos e profissionais que precisam arquivar ou restaurar documentos físicos com qualidade superior.",
    "preco": 3591.99,
    "promocao": 0.88,
    "fabricante": "Epson",
    "modelo": "V19",
    "estoque": 0
  },
  {
    "id": "024",
    "nome": "Adaptador Bluetooth USB 5.0 TP-Link UB500",
    "categoria": "Acessórios",
    "descricao": "O TP-Link UB500 é um adaptador Bluetooth 5.0 USB compacto, projetado para adicionar conectividade sem fio a computadores e notebooks com Windows. Com suporte a BLE (Bluetooth Low Energy), oferece maior alcance, menor consumo de energia e transferência de dados mais estável em comparação com versões anteriores. Ideal para conectar fones, teclados, mouses, controles de videogame e outros dispositivos Bluetooth. Seu tamanho ultracompacto permite deixá-lo plugado o tempo todo sem atrapalhar a mobilidade. Com instalação simples e rápida, é uma solução moderna e confiável para quem deseja ampliar a conectividade do seu sistema.",
    "preco": 655.99,
    "promocao": 0.87,
    "fabricante": "TP-Link",
    "modelo": "UB500",
    "estoque": 50
  },
  {
    "id": "025",
    "nome": "Suporte Articulado para Monitor ELG F80N",
    "categoria": "Acessórios",
    "descricao": "O ELG F80N é um suporte articulado para monitor com mecanismo de braço com pistão a gás, oferecendo mobilidade e conforto ergonômico. Suporta telas de 17 a 32 polegadas, com peso de até 9kg, e é compatível com padrão VESA 75x75 e 100x100. Permite ajuste de altura, inclinação, rotação e giro de 360º, tornando-o ideal para estações de trabalho dinâmicas e setups gamers. Sua fixação pode ser feita via morsa ou furação na mesa, e o sistema de organização de cabos mantém tudo limpo e organizado. Com construção robusta em aço e acabamento premium, combina resistência com elegância.",
    "preco": 1274.99,
    "promocao": 0.8,
    "fabricante": "ELG",
    "modelo": "F80N",
    "estoque": 26
  },
  {
    "id": "027",
    "nome": "Hub USB 3.0 Multilaser 4 Portas",
    "categoria": "Acessórios",
    "descricao": "O Hub USB 3.0 Multilaser de 4 portas é um acessório essencial para expandir a conectividade de notebooks e PCs com poucas entradas USB. Compatível com USB 3.0, oferece transferência de dados de até 5Gbps, ideal para pen drives, HDs externos, impressoras e outros periféricos. Seu design compacto facilita o transporte, sendo perfeito para o dia a dia no trabalho, estudo ou home office. O cabo integrado proporciona praticidade, e seu funcionamento plug and play não exige drivers. Excelente custo-benefício para quem precisa de mais portas com velocidade e estabilidade.",
    "preco": 718.99,
    "promocao": 0.9,
    "fabricante": "Multilaser",
    "modelo": "AC282",
    "estoque": 60
  },
  {
    "id": "028",
    "nome": "Cabo HDMI 2.0 4K 2 Metros",
    "categoria": "Acessórios",
    "descricao": "O Cabo HDMI 2.0 4K de 2 metros é ideal para quem deseja conectar computadores, consoles, TVs e monitores com alta qualidade de imagem e som. Suporta resoluções 4K a 60Hz, HDR, áudio multicanal, CEC e HDCP 2.2, garantindo compatibilidade com os padrões mais modernos. Os conectores banhados a ouro aumentam a durabilidade e melhoram a qualidade da conexão. Com 2 metros de comprimento, oferece flexibilidade ideal para setups domésticos ou profissionais. Perfeito para aproveitar ao máximo conteúdos em alta definição com estabilidade e desempenho.",
    "preco": 261.99,
    "promocao": 0.86,
    "fabricante": "Exbom",
    "modelo": "CBX-HM20",
    "estoque": 120
  },
  {
    "id": "037",
    "nome": "SSD NVMe WD Blue SN570 1TB",
    "categoria": "Componentes",
    "descricao": "O WD Blue SN570 1TB NVMe é um SSD moderno, confiável e extremamente veloz, ideal para elevar o desempenho geral do sistema. Com velocidades de leitura de até 3500 MB/s, é perfeito para quem busca tempos de inicialização rápidos, carregamento instantâneo de softwares pesados, jogos e projetos criativos. Utilizando interface PCIe Gen3 x4, é compatível com a maioria das placas-mãe modernas com slot M.2. Além de desempenho, oferece eficiência energética e alta durabilidade com suporte a tecnologias de correção de erros e monitoramento de integridade. Ideal para criadores de conteúdo, gamers e usuários exigentes que precisam de espaço e velocidade.",
    "preco": 2494.99,
    "promocao": 0.84,
    "fabricante": "Western Digital",
    "modelo": "SN570 1TB",
    "estoque": 22
  },
  {
    "id": "038",
    "nome": "Roteador TP-Link Archer C80 AC1900",
    "categoria": "Redes",
    "descricao": "O TP-Link Archer C80 AC1900 é um roteador dual band de alto desempenho, projetado para oferecer conexão rápida, estável e de longo alcance. Com tecnologia Wi-Fi AC1900, ele atinge velocidades combinadas de até 1900 Mbps — sendo 1300 Mbps na faixa de 5GHz e 600 Mbps em 2.4GHz — ideal para streaming em 4K, jogos online, videochamadas e múltiplos dispositivos conectados simultaneamente. Conta com 4 antenas externas de alto ganho e tecnologia Beamforming, que direciona o sinal diretamente aos dispositivos conectados, aumentando a estabilidade e o alcance. A função MU-MIMO permite comunicação simultânea com diversos dispositivos, reduzindo o tempo de espera e melhorando a eficiência da rede. Possui recursos de gerenciamento via aplicativo TP-Link Tether, suporte a IPv6, controle parental, criação de redes de convidados, priorização de banda (QoS), e segurança WPA3. Com design moderno e discreto, é ideal para residências e pequenos escritórios que exigem performance superior em Wi-Fi.",
    "preco": 5565.99,
    "promocao": 0.95,
    "fabricante": "TP-Link",
    "modelo": "Archer C80",
    "estoque": 19
  },
  {
    "id": "040",
    "nome": "Adaptador HDMI para VGA com Áudio",
    "categoria": "Acessórios",
    "descricao": "O Adaptador HDMI para VGA com Áudio é a solução perfeita para conectar dispositivos modernos com saída HDMI (como notebooks, consoles, players de mídia) a monitores, projetores ou TVs que utilizam entradas VGA. Compatível com resoluções de até 1080p Full HD, ele converte o sinal digital em analógico sem perda significativa de qualidade. Além da conversão de vídeo, este modelo inclui uma saída de áudio P2 (3,5 mm), permitindo transmitir som para caixas de som, fones de ouvido ou sistemas de áudio externos — algo que adaptadores HDMI-VGA simples geralmente não oferecem. Seu design compacto e leve facilita o transporte, sendo ideal para apresentações, salas de aula, home office ou uso pessoal. Não requer alimentação externa nem instalação de drivers: é plug and play. Uma escolha prática e eficiente para reaproveitar equipamentos com entrada VGA em setups modernos.",
    "preco": 295.99,
    "promocao": 0.84,
    "fabricante": "Exbom",
    "modelo": "AD-HDMI/VGA",
    "estoque": 45
  },
  {
    "id": "041",
    "nome": "Notebook Apple MacBook Pro 16\" M3 Max",
    "categoria": "Computadores",
    "descricao": "O Apple MacBook Pro 16\" com chip M3 Max é um notebook de última geração voltado para profissionais criativos, desenvolvedores e usuários exigentes. Equipado com o poderoso processador Apple M3 Max com CPU de 12 núcleos e GPU de 38 núcleos, 64GB de memória unificada e SSD ultrarrápido de 2TB, oferece desempenho incomparável para edição de vídeo 8K, modelagem 3D, machine learning e multitarefas pesadas. A tela Liquid Retina XDR de 16.2\" com brilho extremo, cores precisas e taxa de atualização ProMotion (até 120Hz) proporciona uma experiência visual imersiva e profissional. Seu chassi em alumínio, bateria de longa duração (até 22 horas) e integração perfeita com o ecossistema Apple tornam este notebook uma referência em design, performance e confiabilidade.",
    "preco": 902496.99,
    "promocao": 0.96,
    "fabricante": "Apple",
    "modelo": "MacBook Pro 16 M3 Max 64GB 2TB",
    "estoque": 3
  },
  {
    "id": "042",
    "nome": "Notebook ASUS Vivobook 15 X1500",
    "categoria": "Computadores",
    "descricao": "O ASUS Vivobook 15 X1500 é uma excelente opção para quem procura um notebook acessível com bom desempenho. Com processador AMD Ryzen 7 5700U, 8GB de RAM e SSD de 512GB, oferece resposta rápida em tarefas cotidianas e produtividade. Sua tela de 15.6” antirreflexo com bordas finas proporciona conforto visual e aproveitamento de espaço. Possui acabamento elegante, teclado completo ABNT2, além de conexões USB-C, HDMI e Wi-Fi AC. É uma ótima escolha para estudantes e profissionais que valorizam mobilidade e eficiência.",
    "preco": 75351.99,
    "promocao": 0.96,
    "fabricante": "ASUS",
    "modelo": "X1500EA-EJ751W",
    "estoque": 6
  },
  {
    "id": "043",
    "nome": "Notebook Samsung Galaxy Book2",
    "categoria": "Computadores",
    "descricao": "O Samsung Galaxy Book2 é um notebook moderno com foco em produtividade e portabilidade. Equipado com processador Intel Core i5-1235U de 12ª geração, 8GB de RAM e SSD NVMe de 256GB, garante performance fluida com baixo consumo energético. Sua tela de 15.6” Full HD possui bordas ultrafinas, proporcionando maior área útil com design compacto. Com apenas 1,5kg, é ideal para quem precisa de mobilidade. Conta com teclado ergonômico, Wi-Fi 6, Bluetooth 5.1, e integração com dispositivos Galaxy. Um notebook inteligente, rápido e elegante.",
    "preco": 11665.99,
    "promocao": 0.76,
    "fabricante": "Samsung",
    "modelo": "Galaxy Book2 NP550XED-KF2BR",
    "estoque": 0
  },
  {
    "id": "044",
    "nome": "Notebook Dell Inspiron 15 3000",
    "categoria": "Computadores",
    "descricao": "O Dell Inspiron 15 3000 oferece um equilíbrio ideal entre desempenho, qualidade e durabilidade. Equipado com processador Intel Core i7-1165G7, 8GB de memória RAM e SSD de 512GB, é capaz de executar desde tarefas simples até aplicações mais exigentes com eficiência. Sua tela de 15.6” com resolução Full HD proporciona imagens nítidas e vibrantes, enquanto o acabamento robusto em preto fosco garante estilo e resistência. Inclui portas USB 3.2, HDMI, Wi-Fi dual band e teclado com padrão ABNT2. Perfeito para quem busca um notebook versátil e confiável.",
    "preco": 169956.99,
    "promocao": 0.98,
    "fabricante": "Dell",
    "modelo": "Inspiron i15-i1100-A40P",
    "estoque": 8
  },
  {
    "id": "045",
    "nome": "Pendrive Quântico UltraTurbo 128 Núcleos 128TB",
    "categoria": "Especiais",
    "descricao": "O Pendrive Quântico UltraTurbo redefine os limites do bom senso com seus inacreditáveis 128 núcleos de processamento dedicados exclusivamente a armazenar memes e trabalhos da faculdade. Com 128TB de capacidade, ele promete guardar todos os vídeos do YouTube em 4K — duas vezes. Sua carcaça é feita de liga espacial reciclada de satélites aposentados e ele conta com um LED RGB que melhora a performance (segundo o fabricante). Ideal para quem precisa mais de sarcasmo do que de armazenamento real.",
    "preco": 999999.99,
    "promocao": 0.97,
    "fabricante": "TechOverkill",
    "modelo": "PQ-128C-128TB-RGB",
    "estoque": 42
  },
  {
    "id": "046",
    "nome": "Roteador Gamer Interplanetário WarpX 2.4TBS",
    "categoria": "Especiais",
    "descricao": "Conecte-se à internet de Marte (ou tente) com o Roteador Gamer Interplanetário WarpX. Promete impressionantes 2,4 terabits por segundo, mas apenas se operado em temperaturas abaixo de -169°C, sob a luz da lua cheia e com sacrifício de uma placa-mãe antiga. Inclui 47 antenas dobráveis com ângulo ajustável via pensamento positivo. Compatível com protocolos Wi-Fi 7, 8 e imaginários. Ideal para gamers que jogam com alienígenas ou gostam de overkill tecnológico em LAN parties dimensionais.",
    "preco": 1499999.00,
    "promocao": 0.9,
    "fabricante": "GalacticNet",
    "modelo": "GX-WARPX-ULTRA",
    "estoque": 3
  }
]